tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/0/U
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (241.841 16.9112 0);

boundaryField
{
    inlet-outlet
    {
        type            fixedValue;
        value           uniform (241.841 16.9112 0);
    }

    body            
    {
        type            slip;
    }

    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
