tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class polyBoundaryMesh;
    location    "constant/polyMesh";
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
inlet-outlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 40;
    startFace 9808;
}

body
{
    type patch;
    physicalType slip;
    nFaces 204;
    startFace 9848;
}

defaultFaces
{
    type empty;
    physicalType empty;
    nFaces 13240;
    startFace 10052;
}
)

// ************************************************************************* //
