tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          thermophysicalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.01348;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           10000;
        Tcommon         1000;
        Cp              1007;
        Hf              0;
        highCpCoeffs    ( 2.9525407 0.0013968838 -4.9262577e-07 7.8600091e-11 -4.6074978e-15 -923.93753 5.8718221 );
        lowCpCoeffs     ( 3.5309628 -0.0001236595 -5.0299339e-07 2.4352768e-09 -1.4087954e-12 -1046.9637 2.9674391 );
    }
    transport
    {
        As              1.458e-06;
        Ts              110;
        Pr              0.72;
    }
}

// name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.9 1007 0 0 0.7;
// mixture         air 1 11640.2561438975 2.5 0 0 0.7;

// ************************************************************************* //
