tutorials/compressible/DBNS/explicitDBNSSolver/NACA0012_M075_a4/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver    diagonal;
    };

    "(k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner
        {
            preconditioner  USGS;
        }
        tolerance       1e-08;
        relTol          1e-05;
    }
}

// ************************************************************************* //
